STMicroelectronics/STM32CubeG4/Projects/STM32G474E-EVAL/Demonstrations/Modules/calendar/app_calendar.c
/* used to exit application */
static __IO uint8_t UserEvent=0;
static __IO uint8_t UserAction=0;

/* Private typedef -----------------------------------------------------------*/
/* External variables --------------------------------------------------------*/
const K_ModuleItem_Typedef ModuleCalendar =
{
  MODULE_CALENDAR,
  _CalendarConfig,
  _CalendarDemoExec,
  _CalendarExit,
  NULL
};

/* RTC Handle variable */
extern RTC_HandleTypeDef RtcHandle;


/**
  * @brief  setup the HW for Calendar application
  * @param  None.
  * @retval KMODULE_RETURN status.
  */
KMODULE_RETURN _CalendarConfig(void)
{
  HAL_StatusTypeDef status = HAL_ERROR;

  /* HAL_RTC_Init has been already called for Backup reg access */
  /* check if Date has been already set one time, else configure it to
  1st of january 2018 */
  if(__HAL_RTC_GET_FLAG(&RtcHandle, RTC_FLAG_INITS) == 0x00u)
  {
    /* Set Date to 01.01.2018 */
    Date.Date = 0x01u;
    Date.Month = 0x01u;
    Date.Year = 0x18u;
    Date.WeekDay = RTC_WEEKDAY_MONDAY;

    /* Set time to default */
    Time.Hours = 0x00u;
    Time.Minutes = 0x00u;
    Time.Seconds = 0x00u;
    Time.TimeFormat = RTC_HOURFORMAT12_AM;

    /* Set the RTC current Time */
    status = HAL_RTC_SetTime(&RtcHandle, &Time, RTC_FORMAT_BCD);
    if(status != HAL_OK)
    {
      return KMODULE_ERROR_PRE;
    }

    /* Set the RTC current Date */
    HAL_RTC_SetDate(&RtcHandle, &Date, RTC_FORMAT_BCD);
    if(status != HAL_OK)
    {
      return KMODULE_ERROR_PRE;
    }
  }

  CharHeight = (((sFONT *)GUI_GetFont())->Height);
  CharWidth = (((sFONT *)GUI_GetFont())->Width);

  return KMODULE_OK;
}

/**
  * @brief  Run the application
  * @param  None.
  * @retval KMODULE_RETURN status.
  */
KMODULE_RETURN _CalendarDemoExec(void)
{
  /* App initialization    */
  kMenu_Execute(CalendarMenu);
  return KMODULE_OK;
}


/**
  * @brief  Run the applications
  * @param  None.
  * @retval KMODULE_RETURN status.
  */
KMODULE_RETURN _CalendarExit(void)
{
  return KMODULE_OK;
}


/**
  * @brief  Get User action
  * @param  sel   User selection (JOY_SEL,...)
  * @note   This example is the only way to get user information.
  * @retval None
  */
void CalendarMenuUserAction(uint8_t sel)
{
  if (UserAction == 0)
  {
    UserAction = 1;
  }
  /* store user event */
  UserEvent = sel;
}


/**
  * @brief  Adjusts time.
  * @param  None
  * @retval None
  */
static void Calendar_TimeSet(void)
{
  /* Clear menu lines */
  Calendar_ClearMenuLines();

  /* PreAdjust Time */
  Calendar_TimePreAdjust();
}


/**
  * @brief  Displays the current time.
  * @param  time current time
  * @retval None
  */
static void Calendar_TimeDisplay(RTC_TimeTypeDef *time)
{
  char showtime[14] = {0};

  sprintf((char*)showtime,"     %02X:%02X:%02X",time->Hours, time->Minutes, time->Seconds);
  GUI_DisplayStringAtLine(TIME_LINE_NB, (uint8_t *) showtime);
}


/**
  * @brief  Displays information on LCD for the time configuration
  * @param  None
  * @retval None
  */
static void Calendar_TimePreAdjust(void)
{
  RTC_TimeTypeDef timecurrent = {0};
  RTC_TimeTypeDef timeset = {0};
  RTC_DateTypeDef dateset = {0};

  /* Get the RTC current Time */
  HAL_RTC_GetTime(&RtcHandle, &timecurrent, RTC_FORMAT_BCD);
  /* Get the RTC current Date */
  HAL_RTC_GetDate(&RtcHandle, &dateset, RTC_FORMAT_BCD);

  /* Display the current time */
  Calendar_TimeDisplay(&timecurrent);

  /* Call Time selection function */
  Calendar_TimeRegulate(&timecurrent, &timeset);

  /* Set the RTC current Time */
  HAL_RTC_SetTime(&RtcHandle, &timeset, RTC_FORMAT_BCD);
  /* Set the RTC current Date */
  HAL_RTC_SetDate(&RtcHandle, &dateset, RTC_FORMAT_BCD);
}


/**
  * @brief  Shows the current time (HH/MM/SS) on LCD.
  * @param  None
  * @retval None
  */
static void Calendar_TimeShow(void)
{
  uint32_t ypos = (CharHeight * (TIME_LINE_NB + 1));
  uint32_t xpos;
  uint32_t pXSize;
  RTC_TimeTypeDef time = {0};
  RTC_DateTypeDef date = {0};
  uint32_t RCC_InitSysClkSaved;
  RCC_OscInitTypeDef RCC_OscInitStructure, RCC_OscInitStructureSaved; 
  BSP_LCD_GetXSize(LCD_INSTANCE, &pXSize);
  xpos =  (pXSize - 128) >> 1;
  UserAction = 0x00u;

  /* Clear menu lines */
  Calendar_ClearMenuLines();

  kStorage_OpenFileDrawPixel(ypos, xpos, (uint8_t *)"STFILES/WATCH.BMP");

  /* save RCC configuration */
  HAL_RCC_GetOscConfig(&RCC_OscInitStructureSaved);
  RCC_OscInitStructure = RCC_OscInitStructureSaved;
  
  RCC_OscInitStructure.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStructure.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStructure.PLL.PLLM = RCC_PLLM_DIV4;
  RCC_OscInitStructure.PLL.PLLN = 23;
  RCC_OscInitStructure.PLL.PLLQ = RCC_PLLQ_DIV8; 
  /* save sysclk source */
  RCC_InitSysClkSaved = (__HAL_RCC_GET_SYSCLK_SOURCE() >> RCC_CFGR_SWS_Pos);
  /* in case PLL is system clock, first set system clock on HSI before
     reconfig PLL */
  if (__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_SYSCLKSOURCE_STATUS_PLLCLK)
  {
    __HAL_RCC_SYSCLK_CONFIG(RCC_SYSCLKSOURCE_HSI);
  }
  /* change clock config and PLL */
  HAL_RCC_OscConfig(&RCC_OscInitStructure);
  __HAL_RCC_SYSCLK_CONFIG(RCC_SYSCLKSOURCE_PLLCLK);
 
  /* Wait a press on any JoyStick pushbuttons */
  while (UserAction == 0x00u)
  {
    /* Get the RTC current Time */
    HAL_RTC_GetTime(&RtcHandle, &time, RTC_FORMAT_BCD);
    /* Get the RTC current Date */
    HAL_RTC_GetDate(&RtcHandle, &date, RTC_FORMAT_BCD);

    /* Display current time */
    Calendar_TimeDisplay(&time);
  }
  /* restore clock config */
  /* in case PLL is system clock, first set system clock on HSI before
     reconfig PLL */
  if (__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_SYSCLKSOURCE_STATUS_PLLCLK)
  {
    __HAL_RCC_SYSCLK_CONFIG(RCC_SYSCLKSOURCE_HSI);
  }
  /* restore initial pll clock config */
  HAL_RCC_OscConfig(&RCC_OscInitStructureSaved);
  /* restore PLL source */
  __HAL_RCC_SYSCLK_CONFIG(RCC_InitSysClkSaved);
}


/**
  * @brief  Adjusts the current date (MM/DD/YYYY).
  * @param  None
  * @retval None
  */
static void Calendar_DateSet(void)
{
  /* Get back font specifications */
  GUI_SetFont(&Font20);
  CharHeight = (((sFONT *)GUI_GetFont())->Height);
  CharWidth = (((sFONT *)GUI_GetFont())->Width);

