STMicroelectronics/STM32CubeG4/Projects/STM32G474E-EVAL/Demonstrations/Modules/calendar/app_calendar.c
  /* Clear the LCD */
  GUI_Clear(GUI_COLOR_WHITE);

  Calendar_DatePreAdjust();

  GUI_SetFont(&Font24);
  CharHeight = (((sFONT *)GUI_GetFont())->Height);
  CharWidth = (((sFONT *)GUI_GetFont())->Width);

}


/**
  * @brief  Displays the date in graphic mode.
  * @param  Year    Year to display
  * @param  Month   Month to display
  * @param  Date    Date to display
  * @retval None
  */
static void Calendar_DateDisplay(uint8_t Year, uint8_t Month, uint8_t Day)
{
  uint32_t mline = 0, mcolumn = 319, month = 0;
  uint32_t monthlength = 0;
  char linedisplay[25];
  uint32_t pXSize;

  if (Month == 2)
  {
    if (Calendar_IsLeapYear(Year))
    {
      monthlength = 30;
    }
    else
    {
      monthlength = MonLen[Month - 1];
    }
  }
  else
  {
    monthlength = MonLen[Month - 1];
  }

  GUI_SetTextColor(GUI_COLOR_WHITE);
  GUI_DrawRect(daycolumn, dayline, CharWidth*2, CharHeight-2, GUI_COLOR_WHITE);

  /* Set the Back Color */
  GUI_SetBackColor(GUI_COLOR_ST_PINK);
  GUI_SetTextColor(GUI_COLOR_ST_PINK);
  BSP_LCD_GetXSize(LCD_INSTANCE, &pXSize);
  GUI_FillRect(0, 0, pXSize, Font20.Height,GUI_COLOR_ST_PINK);
  GUI_FillRect(0, LINE(1), pXSize, Font20.Height, GUI_COLOR_ST_PINK);
  /* Set the Text Color */
  GUI_SetTextColor(GUI_COLOR_WHITE);

  sprintf((char*)linedisplay,"    %s  20%02d     ", MonthNames[Month - 1], Year);
  GUI_DisplayStringAtLine(0, (uint8_t*)linedisplay);

  /* Determines the week number, day of the week of the selected date */
  Calendar_WeekDayNum(Year, Month, Day);
  DateNb = dn;

  sprintf((char*)linedisplay," WEEK: %02ld   DAY: %03ld    ", wn, dc);
  GUI_DisplayStringAtLine(1, (uint8_t*)linedisplay);

  /* Set the Back Color */
  GUI_SetBackColor(GUI_COLOR_ST_GREEN_LIGHT);
  GUI_SetTextColor(GUI_COLOR_ST_GREEN_LIGHT);
  GUI_FillRect(0, LINE(2), pXSize, Font20.Height, GUI_COLOR_ST_GREEN_LIGHT);
  GUI_SetTextColor(GUI_COLOR_WHITE);
  GUI_DisplayStringAtLine(2, (uint8_t*) " Mo Tu We Th Fr Sa Su   ");
  GUI_SetBackColor(GUI_COLOR_WHITE);
  GUI_SetTextColor(GUI_COLOR_ST_BLUE);

  /* Determines the week number, day of the week of the selected date */
  Calendar_WeekDayNum(Year, Month, 1);

  /* Clear first & last calendar lines */
  GUI_ClearStringLine(3);
  GUI_ClearStringLine(7);
  GUI_ClearStringLine(8);

  mline = LINE(3);
  mcolumn = ((CharWidth * 3) * dn);
  for (month = 1; month < monthlength; month++)
  {
    /* display first space */
    GUI_DisplayChar(mcolumn, mline, ' ');
    mcolumn += CharWidth;

    if (month == Day)
    {
      daycolumn = mcolumn;
      dayline = mline;
    }

    if (month / 10)
    {
      GUI_DisplayChar(mcolumn, mline, ((month / 10) + 0x30));
    }
    else
    {
      GUI_DisplayChar(mcolumn, mline, ' ');
    }
    mcolumn += CharWidth;

    GUI_DisplayChar(mcolumn, mline, ((month % 10) + 0x30));
    mcolumn += CharWidth;

    if (mcolumn >= ((7 * 3) * CharWidth))
    {
      mcolumn = 0;
      mline += CharHeight;
    }
  }

  GUI_SetTextColor(GUI_COLOR_ST_GREEN_LIGHT);
  GUI_DrawRect(daycolumn, dayline, CharWidth*2, CharHeight-2, GUI_COLOR_ST_GREEN_LIGHT);
}


/**
  * @brief  Displays information on LCD for the time configuration
  * @param  None
  * @retval None
  */
static void Calendar_DatePreAdjust(void)
{
  RTC_DateTypeDef datecurrent = {0};
  RTC_DateTypeDef dateset = {0};
  RTC_TimeTypeDef timeset = {0};

  /* Get the RTC current Time */
  HAL_RTC_GetTime(&RtcHandle, &timeset, RTC_FORMAT_BCD);
  /* Get the RTC current Date */
  HAL_RTC_GetDate(&RtcHandle, &datecurrent, RTC_FORMAT_BCD);

  /* Call Time selection function */
  Calendar_DateRegulate(&datecurrent, &dateset);

  /* Set the RTC current Time */
  HAL_RTC_SetTime(&RtcHandle, &timeset, RTC_FORMAT_BCD);
  /* Set the RTC current Date */
  HAL_RTC_SetDate(&RtcHandle, &dateset, RTC_FORMAT_BCD);
}


/**
  * @brief  Basically show date (MM/DD/YYYY).
  * @param  None
  * @retval None
  */
static void Calendar_DateShow(void)
{
  RTC_TimeTypeDef time = {0};
  RTC_DateTypeDef date = {0};
  char showdate[20] = {0};

  UserAction = 0x00u;

  /* Clear menu lines */
  Calendar_ClearMenuLines();

  /* Wait a press on any JoyStick pushbuttons */
  while (UserAction == 0x00u)
  {
    /* Get the RTC current Time */
    HAL_RTC_GetTime(&RtcHandle, &time, RTC_FORMAT_BCD);
    /* Get the RTC current Date */
    HAL_RTC_GetDate(&RtcHandle, &date, RTC_FORMAT_BCD);

    sprintf((char*)showdate," %s %02X.%02X.20%02X",DayNames[date.WeekDay - 1], date.Date, date.Month, date.Year);
    GUI_DisplayStringAtLine(DATE_LINE_NB, (uint8_t *) showdate);

  }
}


/**
  * @brief  Set the time entered by user, using menu navigation keys.
  * @param  TimeInput     current time when entering function
  * @param  TimeOutput    value selected by user
  * @retval None
  */
static void Calendar_TimeRegulate(RTC_TimeTypeDef *TimeInput, RTC_TimeTypeDef *TimeOutput)
{
  uint16_t charwidth;
  uint8_t timearray[3];
  uint8_t rowarray[3];
  uint8_t index = 0;
  uint8_t digit = 0;
  char display[3];

  charwidth = GUI_GetFont()->Width;
  rowarray[0] = 5 * charwidth;
  rowarray[1] = 8 * charwidth;
  rowarray[2] = 11 * charwidth;

  /* Initially display in red selected field */
  /* store time in array */
  timearray[0] = RTC_Bcd2ToByte(TimeInput->Hours);
  timearray[1] = RTC_Bcd2ToByte(TimeInput->Minutes);
  timearray[2] = RTC_Bcd2ToByte(TimeInput->Seconds);

  /* Display current digit in Red */
  digit = timearray[index];
  display[0] = ((digit / 10) + 0x30);
  display[1] = ((digit % 10) + 0x30);
  display[2] = (0x00);

  /* Set the Text Color */
  GUI_SetTextColor(GUI_COLOR_ST_PINK);

  /* Display new value */
  GUI_DisplayStringAt(rowarray[index], LINE(TIME_LINE_NB), (uint8_t *)display, LEFT_MODE);

  UserEvent = JOY_NONE;
  /* Endless loop */
  while (UserEvent != JOY_SEL)
  {
    if((UserEvent == JOY_UP) || (UserEvent == JOY_DOWN))
    {
      if(UserEvent == JOY_UP)
      {
        /* Increase current value */
        digit++;

        /* Handle hours , minutes, secondes overlap */
        if(((index == 0) && (digit > 23)) || (digit > 59))
        {
          digit = 0;
        }
      }

