STMicroelectronics/STM32CubeG4/Projects/STM32G474E-EVAL/Demonstrations/Modules/calendar/app_calendar.c
      if(UserEvent == JOY_DOWN)
      {
        /* Decrease current value */
        digit--;

        /* Handle hours , minutes, secondes overlap */
        if((index == 0) && (digit > 24))
        {
          digit = 23;
        }
        else if (digit > 60)
        {
          digit = 59;
        }
      }

      /* Display current digit in Red */
      display[0] = ((digit / 10) + 0x30);
      display[1] = ((digit % 10) + 0x30);

      /* Display new value */
      GUI_DisplayStringAt(rowarray[index], LINE(TIME_LINE_NB), (uint8_t *)display, LEFT_MODE);

      /* Store digit into local variable */
      timearray[index] = digit;

      UserEvent = JOY_NONE;
    }

    if((UserEvent == JOY_RIGHT) || (UserEvent == JOY_LEFT))
    {
      /* Set the Text Color */
      GUI_SetTextColor(GUI_COLOR_ST_BLUE);

      /* Display new value */
      GUI_DisplayStringAt(rowarray[index], LINE(TIME_LINE_NB), (uint8_t *)display, LEFT_MODE);

      /* Handle index following selection */
      if(UserEvent == JOY_RIGHT)
      {
        index++;
        if(index > 2)
        {
          index = 0;
        }
      }
      else
      {
        index--;
        if(index > 2)
        {
          index = 2;
        }
      }
      /* Set the Text Color */
      GUI_SetTextColor(GUI_COLOR_ST_PINK);

      /* Display current digit in Red */
      digit = timearray[index];
      display[0] = ((digit / 10) + 0x30);
      display[1] = ((digit % 10) + 0x30);

      /* Display new value */
      GUI_DisplayStringAt(rowarray[index], LINE(TIME_LINE_NB), (uint8_t *)display, LEFT_MODE);

      UserEvent = JOY_NONE;
    }
  }

  /* store time in array */
  TimeOutput->Hours = RTC_ByteToBcd2(timearray[0]);
  TimeOutput->Minutes = RTC_ByteToBcd2(timearray[1]);
  TimeOutput->Seconds = RTC_ByteToBcd2(timearray[2]);
}



/**
  * @brief  Set date entered by user, using menu navigation keys.
  * @param  DateInput    current date when entering function
  * @param  DateOutput   value selected by user
  * @retval None
  */
static void Calendar_DateRegulate(RTC_DateTypeDef *DateInput, RTC_DateTypeDef *DateOutput)
{
  uint8_t year = RTC_Bcd2ToByte(DateInput->Year);
  uint8_t month = RTC_Bcd2ToByte(DateInput->Month);
  uint8_t day = RTC_Bcd2ToByte(DateInput->Date);

  /* Reset Globale variable */
  UserEvent = JOY_NONE;

  Calendar_DateDisplay(year, month, day);

  /* Regulate year */
  GUI_SetTextColor(GUI_COLOR_ST_PINK);
  GUI_DisplayStringAtLine(9, (uint8_t*) "UP/DOWN: Select Year");
  GUI_DisplayStringAtLine(10, (uint8_t*) "SEL: to set  ");
  Calendar_RegulateYear(&year, &month, &day);

  /* Regulate the month */
  GUI_SetTextColor(GUI_COLOR_ST_PINK);
  GUI_ClearStringLine(9);
  GUI_ClearStringLine(10);
  GUI_DisplayStringAtLine(9, (uint8_t*) "UP/DOWN: Select Month ");
  GUI_DisplayStringAtLine(10, (uint8_t*) "SEL: to set  ");
  Calendar_RegulateMonth(&year, &month, &day);

  /* Regulate day */
  GUI_SetTextColor(GUI_COLOR_ST_PINK);
  GUI_ClearStringLine(9);
  GUI_ClearStringLine(10);
  GUI_DisplayStringAtLine(9, (uint8_t*) "UP/DOWN/LEFT/RIGHT:");
  GUI_DisplayStringAtLine(10, (uint8_t*) "Select Day ");
  GUI_DisplayStringAtLine(11, (uint8_t*) "SEL: to set  ");
  Calendar_RegulateDay(&year, &month, &day);

  GUI_ClearStringLine(9);
  GUI_ClearStringLine(10);
  GUI_ClearStringLine(11);

  DateOutput->Year = RTC_ByteToBcd2(year);
  DateOutput->Month = RTC_ByteToBcd2(month);
  DateOutput->Date = RTC_ByteToBcd2(day);
  DateOutput->WeekDay= RTC_ByteToBcd2(DateNb+1);
}


/**
  * @brief  Monitor Year selection
  * @param  Year    to be updated
  * @param  Month   current month
  * @param  Day     current day
  * @retval None
  */
static void Calendar_RegulateYear(uint8_t *Year, uint8_t *Month, uint8_t *Day)
{
  uint8_t tmpValue = *Year;

  /* Endless loop */
  while (UserEvent != JOY_SEL)
  {
    if ((UserEvent == JOY_UP) || (UserEvent == JOY_DOWN))
    {
      /* If "UP" pushbutton is pressed */
      if (UserEvent == JOY_UP)
      {
        /* Decrease the value of the digit */
        tmpValue++;

        if (tmpValue > 99)
        {
          tmpValue = 00;
        }
      }
      /* If "DOWN" pushbutton is pressed */
      if (UserEvent == JOY_DOWN)
      {
        /* Decrease the value of the digit */
        tmpValue--;
        if (tmpValue > 99)
        {
          tmpValue = 99;
        }
      }

      /* display updated calendar */
      Calendar_DateDisplay(tmpValue, *Month, *Day);

      /* Reset Globale variable */
      UserEvent = JOY_NONE;
    }
  }

  /* Reset Globale variable */
  UserEvent = JOY_NONE;

  /* return selected value */
  *Year = tmpValue;
}


/**
  * @brief  Monitor Month selection
  * @param  Year   current year
  * @param  Month  to be updated
  * @param  Day    current day
  * @retval None
  */
static void Calendar_RegulateMonth(uint8_t *Year, uint8_t *Month, uint8_t *Day)
{
  uint8_t tmpValue = *Month;

  /* loop on Key press */
  while (UserEvent != JOY_SEL)
  {
    if ((UserEvent == JOY_UP) || (UserEvent == JOY_DOWN))
    {
      /* If "UP" pushbutton is pressed */
      if (UserEvent == JOY_UP)
      {
        /* Decrease the value of the digit */
        tmpValue++;

        if (tmpValue > 12)
        {
          tmpValue = 1;
        }
      }
      /* If "DOWN" pushbutton is pressed */
      if (UserEvent == JOY_DOWN)
      {
        /* Decrease the value of the digit */
        tmpValue--;
        if (tmpValue < 1)
        {
          tmpValue = 12;
        }
      }

      /* display updated calendar */
      Calendar_DateDisplay(*Year, tmpValue, *Day);

      /* Reset Globale variable */
      UserEvent = JOY_NONE;
    }
  }

  /* Reset Globale variable */
  UserEvent = JOY_NONE;

  /* return selected value */
  *Month = tmpValue;
}


/**
  * @brief  Monitor Day selection
  * @param  Year   current year
  * @param  Month  current month
  * @param  Day    to be updated
  * @retval None
  */
static void Calendar_RegulateDay(uint8_t *Year, uint8_t *Month, uint8_t *Day)
{
  uint8_t tmpValue = *Day;
  uint32_t maxvalue= 0;
  uint8_t increase = 0;

  if (*Month == 2)
  {
    if (Calendar_IsLeapYear(*Year))
      { maxvalue= 29; }
    else
      { maxvalue= (MonLen[*Month - 1] - 1); }
  }
  else
  {
    maxvalue= (MonLen[*Month - 1] - 1);
  }

  /* loop on Key press */
  while (UserEvent != JOY_SEL)
  {
    if ((UserEvent != JOY_SEL) && (UserEvent != JOY_NONE))
    {
      if (UserEvent == JOY_UP)
      {
        tmpValue -= 7;
        increase = 0;
      }
      else if (UserEvent == JOY_DOWN)
      {
        tmpValue += 7;
        increase = 1;
      }
      else if (UserEvent == JOY_LEFT)
      {
        tmpValue--;
        increase = 0;
      }
      else if (UserEvent == JOY_RIGHT)
      {
        tmpValue++;
        increase = 1;
      }

      if (tmpValue > maxvalue)
      {
        if(increase != 0)
        {
          tmpValue = 1;
        }
        else
        {
          tmpValue = maxvalue;
        }
      }

