STMicroelectronics/STM32CubeG4/Projects/STM32G474E-EVAL/Demonstrations/Modules/calendar/app_calendar.c
      /* display updated calendar */
      Calendar_DateDisplay(*Year, *Month, tmpValue);

      /* Reset Globale variable */
      UserEvent = JOY_NONE;
    }
  }

  /* Reset Globale variable */
  UserEvent = JOY_NONE;

  /* return selected value */
  *Day = tmpValue;
}


/**
  * @brief  Adjusts time.
  * @param  None
  * @retval None
  */
static void Calendar_AlarmSet(void)
{
  uint32_t ypos = (CharHeight * (TIME_LINE_NB + 1));
  uint32_t xpos;
  uint32_t pXSize;

    BSP_LCD_GetXSize(LCD_INSTANCE, &pXSize);
    xpos = (pXSize - 128) >> 1;

  /* Clear menu lines */
  Calendar_ClearMenuLines();

  kStorage_OpenFileDrawPixel(ypos, xpos, (uint8_t *)"STFILES/ALARM.BMP");

  /* PreAdjust Time */
  Calendar_AlarmPreAdjust();
}


/**
  * @brief  Displays information on LCD for the alarm time configuration
  * @param  None
  * @retval None
  */
static void Calendar_AlarmPreAdjust(void)
{
  RTC_TimeTypeDef timecurrent = {0};
  RTC_TimeTypeDef timeset = {0};
  RTC_DateTypeDef dateset = {0};
  RTC_AlarmTypeDef alarm = {0};


  /* Get the RTC current Time */
  HAL_RTC_GetTime(&RtcHandle, &timecurrent, RTC_FORMAT_BCD);
  /* Get the RTC current Date */
  HAL_RTC_GetDate(&RtcHandle, &dateset, RTC_FORMAT_BCD);

  /* Display the current time */
  Calendar_TimeDisplay(&timecurrent);

  /* Call Time selection function */
  Calendar_TimeRegulate(&timecurrent, &timeset);

  /* Get back alarm time */
  alarm.Alarm = RTC_ALARM_A;
  alarm.AlarmDateWeekDay = RTC_WEEKDAY_MONDAY;
  alarm.AlarmDateWeekDaySel = RTC_ALARMDATEWEEKDAYSEL_DATE;
  alarm.AlarmMask = RTC_ALARMMASK_DATEWEEKDAY;
  alarm.AlarmSubSecondMask = RTC_ALARMSUBSECONDMASK_ALL;
  alarm.AlarmTime.TimeFormat = RTC_HOURFORMAT12_AM;
  alarm.AlarmTime.Hours = timeset.Hours;
  alarm.AlarmTime.Minutes = timeset.Minutes;
  alarm.AlarmTime.Seconds = timeset.Seconds;

  /* Set the new alarm time */
  HAL_RTC_SetAlarm_IT(&RtcHandle, &alarm, RTC_FORMAT_BCD);
}


/**
  * @brief  Adjusts Alarm.
  * @param  None
  * @retval None
  */
static void Calendar_AlarmDisable(void)
{
  /* Clear menu lines */
  Calendar_ClearMenuLines();

  /* Set the new alarm time */
  HAL_RTC_DeactivateAlarm(&RtcHandle, RTC_ALARM_A);

  /* Display information */
  GUI_DisplayStringAtLine(TIME_LINE_NB, (uint8_t *)"Alarm is disabled");
  HAL_Delay(500);
}


/**
  * @brief  Alarm A callback function of the Irq Handler that makes led toggling
  * @param  None
  * @retval None
  */
void HAL_RTC_AlarmAEventCallback(RTC_HandleTypeDef *hrtc)
{
  uint32_t time = 0x40;
  uint8_t led = 0;
  __IO uint32_t period;

  while(time > 0)
  {
    BSP_LED_Toggle((Led_TypeDef) led);

    /* manage led to toggle */
    led++;
    if(led > 3)
    {
      led = 0;

      /* waiting period */
      period = 0xFFFFF;
      while(period > 0)
      {
        period--;
      }
    }

    /* waiting period */
    period = 0xFFFFF;
    while(period > 0)
    {
      period--;
    }

    /* decrease time */
    time--;
  }

  /* make sure led s are off when leaving */
  BSP_LED_Off(LED1);
  BSP_LED_Off(LED2);
  BSP_LED_Off(LED3);
  BSP_LED_Off(LED4);
}


/**
  * @brief  Manage menu lines clearing
  * @param  None
  * @retval None
  */
static void Calendar_ClearMenuLines(void)
{
  /* Clear menu lines */
  GUI_ClearStringLine(1);
  GUI_ClearStringLine(2);
  GUI_ClearStringLine(3);
}


/**
  * @brief  Determines the week number, the month number and the week day number.
  * @param  nyear   the week number
  * @param  nmonth  the month number
  * @param  nday    the week day number
  * @retval None
  */
static void Calendar_WeekDayNum(uint32_t nyear, uint8_t nmonth, uint8_t nday)
{
  uint32_t a = 0, b = 0, c = 0, s = 0, e = 0, f = 0, g = 0, d = 0;
  int32_t n = 0;
  if (nmonth < 3)
  {
    a = nyear - 1;
  }
  else
  {
    a = nyear;
  }

  b = (a / 4) - (a / 100) + (a / 400);
  c = ((a - 1) / 4) - ((a - 1) / 100) + ((a - 1) / 400);
  s = b - c;
  if (nmonth < 3)
  {
    e = 0;
    f =  nday - 1 + 31 * (nmonth - 1);
  }
  else
  {
    e = s + 1;
    f = nday + (153 * (nmonth - 3) + 2) / 5 + 58 + s;
  }
  g = (a + b) % 7;
  d = (f + g - e) % 7;
  n = f + 3 - d;
  if (n < 0)
  {
    wn = 53 - ((g - s) / 5);
  }
  else if (n > (364 + s))
  {
    wn = 1;
  }
  else
  {
    wn = (n / 7) + 1;
  }
  dn = d;
  dc = f + 1;
}


/**
  * @brief  Check whether the passed year is Leap or not.
  * @param  nYear  year number to be checked
  * @retval 1: leap year
  *         0: not leap year
  */
static uint8_t Calendar_IsLeapYear(uint16_t nYear)
{
  if (nYear % 4 != 0) return 0;
  if (nYear % 100 != 0) return 1;
  return (uint8_t)(nYear % 400 == 0);
}


#undef __APP_CALENDAR_C
#endif
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
